; RUN: %apply-verifier %s |& %filecheck %s
; REQUIRES: llvm-18 || llvm-19

; CHECK-COUNT-7: Location: "{{.*}}quark_stuff.c":"eo_fermion_force_3f":1293

source_filename = "quark_stuff.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.half_wilson_vector = type { [2 x %struct.su3_vector] }
%struct.su3_vector = type { [3 x %struct.complex] }
%struct.complex = type { float, float }
%struct.site = type { i16, i16, i16, i16, i8, i32, %struct.double_prn, i32, [4 x %struct.su3_matrix], [4 x %struct.anti_hermitmat], [4 x float], %struct.su3_vector, %struct.su3_vector, %struct.su3_vector, %struct.su3_vector, %struct.su3_vector, %struct.su3_vector, [4 x %struct.su3_vector], [4 x %struct.su3_vector], %struct.su3_vector, %struct.su3_matrix, %struct.su3_matrix }
%struct.double_prn = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, float }
%struct.anti_hermitmat = type { %struct.complex, %struct.complex, %struct.complex, float, float, float, float }
%struct.su3_matrix = type { [3 x [3 x %struct.complex]] }

@act_path_coeff = external hidden unnamed_addr global [6 x float], align 16, !dbg !0
@sites_on_node = external local_unnamed_addr global i32, align 4
@lattice = external local_unnamed_addr global ptr, align 8

; Function Attrs: nocallback nofree nosync nounwind willreturn memory(argmem: readwrite)
declare void @llvm.lifetime.start.p0(i64 immarg, ptr nocapture) #0


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "act_path_coeff", scope: !2, file: !45, line: 145, type: !46, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 18.1.8", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !41, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/ahueck/workspace/dimeta-tests/testsuite/miniapp/milc/quark_stuff.c", directory: "/home/ahueck/workspace/dimeta-tests/build", checksumkind: CSK_MD5, checksum: "93ceb7c7f928462e7695f7b878049152")
!4 = !{!5, !21, !23, !31, !34}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "su3_vector", file: !7, line: 15, baseType: !8)
!7 = !DIFile(filename: "testsuite/miniapp/milc/include/su3.h", directory: "/home/ahueck/workspace/dimeta-tests", checksumkind: CSK_MD5, checksum: "31997d5e7a0a485a983d1913a2140422")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 15, size: 192, elements: !9)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !8, file: !7, line: 15, baseType: !11, size: 192)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, elements: !19)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "complex", file: !13, line: 76, baseType: !14)
!13 = !DIFile(filename: "testsuite/miniapp/milc/include/complex.h", directory: "/home/ahueck/workspace/dimeta-tests", checksumkind: CSK_MD5, checksum: "fea3aa9a1e9294803e3e0b191e32c97f")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 73, size: 64, elements: !15)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !14, file: !13, line: 74, baseType: !17, size: 32)
!17 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !14, file: !13, line: 75, baseType: !17, size: 32, offset: 32)
!19 = !{!20}
!20 = !DISubrange(count: 3)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "half_wilson_vector", file: !7, line: 47, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 47, size: 384, elements: !26)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !25, file: !7, line: 47, baseType: !28, size: 384)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 384, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 2)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "field_offset", file: !32, line: 42, baseType: !33)
!32 = !DIFile(filename: "testsuite/miniapp/milc/include/macros.h", directory: "/home/ahueck/workspace/dimeta-tests", checksumkind: CSK_MD5, checksum: "e66956ca749f7c5112a24ffaf7306f75")
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "su3_matrix", file: !7, line: 14, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 14, size: 576, elements: !37)
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !36, file: !7, line: 14, baseType: !39, size: 576)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 576, elements: !40)
!40 = !{!20, !20}
!41 = !{!0, !42}
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression(DW_OP_constu, 6, DW_OP_stack_value))
!43 = distinct !DIGlobalVariable(name: "quark_action_npaths", scope: !2, file: !44, line: 31, type: !33, isLocal: true, isDefinition: true)
!44 = !DIFile(filename: "testsuite/miniapp/milc/include/quark_action.h", directory: "/home/ahueck/workspace/dimeta-tests", checksumkind: CSK_MD5, checksum: "4ad0ad963f26e4621ecebbe42a0335e1")
!45 = !DIFile(filename: "testsuite/miniapp/milc/quark_stuff.c", directory: "/home/ahueck/workspace/dimeta-tests", checksumkind: CSK_MD5, checksum: "93ceb7c7f928462e7695f7b878049152")
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 192, elements: !47)
!47 = !{}
!48 = !{i32 7, !"Dwarf Version", i32 5}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 4}
!51 = !{i32 8, !"PIC Level", i32 2}
!52 = !{i32 7, !"PIE Level", i32 2}
!53 = !{i32 7, !"uwtable", i32 2}
!54 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!55 = !{!"clang version 18.1.8"}
!56 = !DISubprogram(name: "malloc", scope: !57, file: !57, line: 672, type: !58, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!57 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "7fa2ecb2348a66f8b44ab9a15abd0b72")
!58 = !DISubroutineType(types: !47)
!59 = !DISubprogram(name: "free", scope: !57, file: !57, line: 687, type: !60, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!60 = distinct !DISubroutineType(types: !61)
!61 = !{null}
!62 = !DISubprogram(name: "scalar_mult_add_su3_vector", scope: !7, file: !7, line: 415, type: !63, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !5, !5, !17, !5}
!65 = distinct !DISubprogram(name: "eo_fermion_force_3f", scope: !45, file: !45, line: 1236, type: !66, scopeLine: 1237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !67)
!66 = !DISubroutineType(types: !61)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !135, !136, !137, !138, !139, !143, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !159}
!68 = !DILocalVariable(name: "eps", arg: 1, scope: !65, file: !45, line: 1236, type: !17)
!69 = !DILocalVariable(name: "nflav1", arg: 2, scope: !65, file: !45, line: 1236, type: !33)
!70 = !DILocalVariable(name: "x1_off", arg: 3, scope: !65, file: !45, line: 1236, type: !31)
!71 = !DILocalVariable(name: "nflav2", arg: 4, scope: !65, file: !45, line: 1236, type: !33)
!72 = !DILocalVariable(name: "x2_off", arg: 5, scope: !65, file: !45, line: 1237, type: !31)
!73 = !DILocalVariable(name: "i", scope: !65, file: !45, line: 1243, type: !33)
!74 = !DILocalVariable(name: "s", scope: !65, file: !45, line: 1244, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "site", file: !77, line: 99, baseType: !78)
!77 = !DIFile(filename: "testsuite/miniapp/milc/include/lattice.h", directory: "/home/ahueck/workspace/dimeta-tests", checksumkind: CSK_MD5, checksum: "b28578d741f5c0e1a18d21b2de13e17c")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 31, size: 8640, elements: !79)
!79 = !{!80, !82, !83, !84, !85, !86, !87, !104, !105, !109, !121, !123, !124, !125, !126, !127, !128, !129, !131, !132, !133, !134}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !78, file: !77, line: 34, baseType: !81, size: 16)
!81 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !78, file: !77, line: 34, baseType: !81, size: 16, offset: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !78, file: !77, line: 34, baseType: !81, size: 16, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !78, file: !77, line: 34, baseType: !81, size: 16, offset: 48)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !78, file: !77, line: 36, baseType: !22, size: 8, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !78, file: !77, line: 38, baseType: !33, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "site_prn", scope: !78, file: !77, line: 41, baseType: !88, size: 704, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_prn", file: !89, line: 11, baseType: !90)
!89 = !DIFile(filename: "testsuite/miniapp/milc/include/random.h", directory: "/home/ahueck/workspace/dimeta-tests", checksumkind: CSK_MD5, checksum: "914e17056f9ae4b421a6226dd1019dca")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 6, size: 704, elements: !91)
!91 = !{!92, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "r0", scope: !90, file: !89, line: 8, baseType: !93, size: 64)
!93 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !90, file: !89, line: 8, baseType: !93, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "r2", scope: !90, file: !89, line: 8, baseType: !93, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "r3", scope: !90, file: !89, line: 8, baseType: !93, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "r4", scope: !90, file: !89, line: 8, baseType: !93, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "r5", scope: !90, file: !89, line: 8, baseType: !93, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "r6", scope: !90, file: !89, line: 8, baseType: !93, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "multiplier", scope: !90, file: !89, line: 9, baseType: !93, size: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "addend", scope: !90, file: !89, line: 9, baseType: !93, size: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ic_state", scope: !90, file: !89, line: 9, baseType: !93, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !90, file: !89, line: 10, baseType: !17, size: 32, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "space1", scope: !78, file: !77, line: 43, baseType: !33, size: 32, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !78, file: !77, line: 50, baseType: !106, size: 2304, offset: 864)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2304, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 4)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "mom", scope: !78, file: !77, line: 62, baseType: !110, size: 1280, offset: 3168)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 1280, elements: !107)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "anti_hermitmat", file: !7, line: 17, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 16, size: 320, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !120}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !112, file: !7, line: 17, baseType: !12, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !112, file: !7, line: 17, baseType: !12, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !112, file: !7, line: 17, baseType: !12, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "m00im", scope: !112, file: !7, line: 17, baseType: !17, size: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "m11im", scope: !112, file: !7, line: 17, baseType: !17, size: 32, offset: 224)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "m22im", scope: !112, file: !7, line: 17, baseType: !17, size: 32, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !112, file: !7, line: 17, baseType: !17, size: 32, offset: 288)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !78, file: !77, line: 66, baseType: !122, size: 128, offset: 4448)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, elements: !107)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !78, file: !77, line: 69, baseType: !6, size: 192, offset: 4576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "resid", scope: !78, file: !77, line: 70, baseType: !6, size: 192, offset: 4768)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "cg_p", scope: !78, file: !77, line: 71, baseType: !6, size: 192, offset: 4960)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "xxx", scope: !78, file: !77, line: 72, baseType: !6, size: 192, offset: 5152)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ttt", scope: !78, file: !77, line: 73, baseType: !6, size: 192, offset: 5344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "g_rand", scope: !78, file: !77, line: 74, baseType: !6, size: 192, offset: 5536)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tempvec", scope: !78, file: !77, line: 93, baseType: !130, size: 768, offset: 5728)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 768, elements: !107)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "templongvec", scope: !78, file: !77, line: 95, baseType: !130, size: 768, offset: 6496)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "templongv1", scope: !78, file: !77, line: 96, baseType: !6, size: 192, offset: 7264)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tempmat1", scope: !78, file: !77, line: 98, baseType: !35, size: 576, offset: 7456)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "staple", scope: !78, file: !77, line: 98, baseType: !35, size: 576, offset: 8032)
!135 = !DILocalVariable(name: "mu", scope: !65, file: !45, line: 1245, type: !33)
!136 = !DILocalVariable(name: "nu", scope: !65, file: !45, line: 1245, type: !33)
!137 = !DILocalVariable(name: "rho", scope: !65, file: !45, line: 1245, type: !33)
!138 = !DILocalVariable(name: "sig", scope: !65, file: !45, line: 1245, type: !33)
!139 = !DILocalVariable(name: "DirectLinks", scope: !65, file: !45, line: 1246, type: !140)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 256, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 8)
!143 = !DILocalVariable(name: "coeff", scope: !65, file: !45, line: 1247, type: !144)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 64, elements: !29)
!145 = !DILocalVariable(name: "ferm_epsilon", scope: !65, file: !45, line: 1247, type: !17)
!146 = !DILocalVariable(name: "OneLink", scope: !65, file: !45, line: 1248, type: !144)
!147 = !DILocalVariable(name: "Lepage", scope: !65, file: !45, line: 1248, type: !144)
!148 = !DILocalVariable(name: "Naik", scope: !65, file: !45, line: 1248, type: !144)
!149 = !DILocalVariable(name: "FiveSt", scope: !65, file: !45, line: 1248, type: !144)
!150 = !DILocalVariable(name: "ThreeSt", scope: !65, file: !45, line: 1248, type: !144)
!151 = !DILocalVariable(name: "SevenSt", scope: !65, file: !45, line: 1248, type: !144)
!152 = !DILocalVariable(name: "mNaik", scope: !65, file: !45, line: 1249, type: !144)
!153 = !DILocalVariable(name: "mLepage", scope: !65, file: !45, line: 1249, type: !144)
!154 = !DILocalVariable(name: "mFiveSt", scope: !65, file: !45, line: 1249, type: !144)
!155 = !DILocalVariable(name: "mThreeSt", scope: !65, file: !45, line: 1249, type: !144)
!156 = !DILocalVariable(name: "mSevenSt", scope: !65, file: !45, line: 1249, type: !144)
!157 = !DILocalVariable(name: "hwvec", scope: !65, file: !45, line: 1250, type: !158)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, elements: !141)
!159 = !DILocalVariable(name: "temp_x", scope: !65, file: !45, line: 1251, type: !23)
!160 = distinct !DIAssignID()
!161 = distinct !DIAssignID()
!162 = distinct !DIAssignID()
!163 = distinct !DIAssignID()
!164 = distinct !DIAssignID()
!165 = !DILocation(line: 0, scope: !65)
!166 = distinct !DIAssignID()
!167 = distinct !DIAssignID()
!168 = distinct !DIAssignID()
!169 = distinct !DIAssignID()
!170 = distinct !DIAssignID()
!171 = distinct !DIAssignID()
!172 = distinct !DIAssignID()
!173 = distinct !DIAssignID()
!174 = distinct !DIAssignID()
!175 = distinct !DIAssignID()
!176 = distinct !DIAssignID()
!177 = !DILocation(line: 1246, column: 3, scope: !65)
!178 = !DILocation(line: 1248, column: 3, scope: !65)
!179 = !DILocation(line: 1249, column: 3, scope: !65)
!180 = !DILocation(line: 1273, column: 25, scope: !65)
!181 = !DILocation(line: 1260, column: 41, scope: !65)
!182 = !DILocation(line: 1261, column: 16, scope: !65)
!183 = distinct !DIAssignID()
!184 = !DILocation(line: 1262, column: 13, scope: !65)
!185 = distinct !DIAssignID()
!186 = distinct !DIAssignID()
!187 = !DILocation(line: 1264, column: 16, scope: !65)
!188 = distinct !DIAssignID()
!189 = distinct !DIAssignID()
!190 = distinct !DIAssignID()
!191 = distinct !DIAssignID()
!192 = !DILocation(line: 1268, column: 16, scope: !65)
!193 = !{!194, !194, i64 0}
!194 = !{!"float", !195, i64 0}
!195 = !{!"omnipotent char", !196, i64 0}
!196 = !{!"Simple C/C++ TBAA"}
!197 = distinct !DIAssignID()
!198 = distinct !DIAssignID()
!199 = !DILocation(line: 1270, column: 15, scope: !65)
!200 = distinct !DIAssignID()
!201 = distinct !DIAssignID()
!202 = !DILocation(line: 1279, column: 3, scope: !65)
!203 = !DILocation(line: 1273, column: 32, scope: !65)
!204 = !DILocation(line: 1273, column: 22, scope: !65)
!205 = !DILocation(line: 1273, column: 39, scope: !65)
!206 = !DILocation(line: 1273, column: 18, scope: !65)
