; RUN: %apply-verifier %s | %filecheck %s
; CHECK-NOT: Stack dump:

; REQUIRES: llvm-14

source_filename = "par_multi_interp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.hypre_ParCSRMatrix = type { %struct.ompi_communicator_t*, i64, i64, i64, i64, i64, i64, %struct.hypre_CSRMatrix*, %struct.hypre_CSRMatrix*, i64*, i64*, i64*, %struct.hypre_ParCSRCommPkg*, %struct.hypre_ParCSRCommPkg*, i32, i32, i32, i64, double, i64*, double*, i32, %struct.hypre_IJAssumedPart* }
%struct.ompi_communicator_t = type opaque
%struct.hypre_CSRMatrix = type { double*, i32*, i32*, i32, i32, i32, i32*, i32, i32, double* }
%struct.hypre_ParCSRCommPkg = type { %struct.ompi_communicator_t*, i32, i32*, i32*, i32*, i32, i32*, i32*, %struct.ompi_datatype_t**, %struct.ompi_datatype_t** }
%struct.ompi_datatype_t = type opaque
%struct.hypre_IJAssumedPart = type { i32, i64, i64, i32, i32*, i64*, i64*, i32* }

; Function Attrs: nounwind uwtable
define i32 @hypre_BoomerAMGBuildMultipass(%struct.hypre_ParCSRMatrix* noundef %A, i32* noundef %CF_marker, i32* noundef %dof_func, i32 noundef %debug_flag, double noundef %trunc_factor, i32 noundef %P_max_elmts, i32 noundef %weight_option, i32* noundef %col_offd_S_to_A) #0 {
entry:
  %pass_pointer = alloca i32*, i32 0, align 8
  %0 = load %struct.ompi_communicator_t*, %struct.ompi_communicator_t** null, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "par_multi_interp.c", directory: "parcsr_ls")
!2 = !{!3, !7, !8, !9, !11, !12, !13, !15, !18, !19, !20, !10, !39}
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !4, line: 424, baseType: !5)
!4 = !DIFile(filename: "mpi.h", directory: "")
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !4, line: 424, flags: DIFlagFwdDecl)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !4, line: 429, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !4, line: 429, flags: DIFlagFwdDecl)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "hypre_ParCSRCommPkg", file: !22, line: 86, baseType: !23)
!22 = !DIFile(filename: "parcsr_mv.h", directory: "parcsr_ls")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 69, size: 640, elements: !24)
!24 = !{!25, !29, !30, !31, !32, !33, !34, !35, !36, !38}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !23, file: !22, line: 71, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !4, line: 423, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !4, line: 423, flags: DIFlagFwdDecl)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "num_sends", scope: !23, file: !22, line: 73, baseType: !10, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "send_procs", scope: !23, file: !22, line: 74, baseType: !9, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "send_map_starts", scope: !23, file: !22, line: 75, baseType: !9, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "send_map_elmts", scope: !23, file: !22, line: 76, baseType: !9, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "num_recvs", scope: !23, file: !22, line: 78, baseType: !10, size: 32, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "recv_procs", scope: !23, file: !22, line: 79, baseType: !9, size: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "recv_vec_starts", scope: !23, file: !22, line: 80, baseType: !9, size: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "send_mpi_types", scope: !23, file: !22, line: 83, baseType: !37, size: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "recv_mpi_types", scope: !23, file: !22, line: 84, baseType: !37, size: 64, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!41 = !{i32 7, !"Dwarf Version", i32 5}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{i32 7, !"openmp", i32 50}
!45 = !{i32 7, !"uwtable", i32 1}
!46 = !DILocalVariable(name: "comm", scope: !47, file: !1, line: 36, type: !26)
!47 = distinct !DISubprogram(name: "hypre_BoomerAMGBuildMultipass", scope: !1, file: !1, line: 23, type: !48, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !105)
!48 = !DISubroutineType(types: !49)
!49 = !{!10, !50, !9, !50, !11, !10, !9, !10, !40, !10, !10, !9, !104}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "hypre_ParCSRMatrix", file: !22, line: 313, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 264, size: 1408, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !52, file: !22, line: 266, baseType: !26, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "global_num_rows", scope: !52, file: !22, line: 268, baseType: !12, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "global_num_cols", scope: !52, file: !22, line: 269, baseType: !12, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "first_row_index", scope: !52, file: !22, line: 270, baseType: !12, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "first_col_diag", scope: !52, file: !22, line: 271, baseType: !12, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_index", scope: !52, file: !22, line: 274, baseType: !12, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_diag", scope: !52, file: !22, line: 275, baseType: !12, size: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !52, file: !22, line: 277, baseType: !62, size: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "hypre_CSRMatrix", file: !64, line: 73, baseType: !65)
!64 = !DIFile(filename: "seq_mv.h", directory: "parcsr_ls")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 54, size: 512, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !65, file: !64, line: 56, baseType: !39, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !65, file: !64, line: 57, baseType: !9, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !65, file: !64, line: 58, baseType: !9, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !65, file: !64, line: 59, baseType: !10, size: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "num_cols", scope: !65, file: !64, line: 60, baseType: !10, size: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "num_nonzeros", scope: !65, file: !64, line: 61, baseType: !10, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "rownnz", scope: !65, file: !64, line: 64, baseType: !9, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "num_rownnz", scope: !65, file: !64, line: 65, baseType: !10, size: 32, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "owns_data", scope: !65, file: !64, line: 68, baseType: !10, size: 32, offset: 416)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "expand_data", scope: !65, file: !64, line: 71, baseType: !39, size: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "offd", scope: !52, file: !22, line: 278, baseType: !62, size: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "col_map_offd", scope: !52, file: !22, line: 279, baseType: !11, size: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "row_starts", scope: !52, file: !22, line: 281, baseType: !11, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "col_starts", scope: !52, file: !22, line: 286, baseType: !11, size: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "comm_pkg", scope: !52, file: !22, line: 292, baseType: !20, size: 64, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "comm_pkgT", scope: !52, file: !22, line: 293, baseType: !20, size: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "owns_data", scope: !52, file: !22, line: 296, baseType: !10, size: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "owns_row_starts", scope: !52, file: !22, line: 298, baseType: !10, size: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "owns_col_starts", scope: !52, file: !22, line: 299, baseType: !10, size: 32, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "num_nonzeros", scope: !52, file: !22, line: 301, baseType: !12, size: 64, offset: 1024)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "d_num_nonzeros", scope: !52, file: !22, line: 302, baseType: !40, size: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "rowindices", scope: !52, file: !22, line: 305, baseType: !11, size: 64, offset: 1152)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rowvalues", scope: !52, file: !22, line: 306, baseType: !39, size: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "getrowactive", scope: !52, file: !22, line: 307, baseType: !10, size: 32, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "assumed_partition", scope: !52, file: !22, line: 309, baseType: !92, size: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "hypre_IJAssumedPart", file: !22, line: 155, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 145, size: 512, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !94, file: !22, line: 147, baseType: !10, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "row_start", scope: !94, file: !22, line: 148, baseType: !12, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "row_end", scope: !94, file: !22, line: 149, baseType: !12, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "storage_length", scope: !94, file: !22, line: 150, baseType: !10, size: 32, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "proc_list", scope: !94, file: !22, line: 151, baseType: !9, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "row_start_list", scope: !94, file: !22, line: 152, baseType: !11, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "row_end_list", scope: !94, file: !22, line: 153, baseType: !11, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sort_index", scope: !94, file: !22, line: 154, baseType: !9, size: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !46, !118, !119, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!106 = !DILocalVariable(name: "A", arg: 1, scope: !47, file: !1, line: 23, type: !50)
!107 = !DILocalVariable(name: "CF_marker", arg: 2, scope: !47, file: !1, line: 24, type: !9)
!108 = !DILocalVariable(name: "S", arg: 3, scope: !47, file: !1, line: 25, type: !50)
!109 = !DILocalVariable(name: "num_cpts_global", arg: 4, scope: !47, file: !1, line: 26, type: !11)
!110 = !DILocalVariable(name: "num_functions", arg: 5, scope: !47, file: !1, line: 27, type: !10)
!111 = !DILocalVariable(name: "dof_func", arg: 6, scope: !47, file: !1, line: 28, type: !9)
!112 = !DILocalVariable(name: "debug_flag", arg: 7, scope: !47, file: !1, line: 29, type: !10)
!113 = !DILocalVariable(name: "trunc_factor", arg: 8, scope: !47, file: !1, line: 30, type: !40)
!114 = !DILocalVariable(name: "P_max_elmts", arg: 9, scope: !47, file: !1, line: 31, type: !10)
!115 = !DILocalVariable(name: "weight_option", arg: 10, scope: !47, file: !1, line: 32, type: !10)
!116 = !DILocalVariable(name: "col_offd_S_to_A", arg: 11, scope: !47, file: !1, line: 33, type: !9)
!117 = !DILocalVariable(name: "P_ptr", arg: 12, scope: !47, file: !1, line: 34, type: !104)
!118 = !DILocalVariable(name: "comm_pkg", scope: !47, file: !1, line: 37, type: !20)
!119 = !DILocalVariable(name: "comm_handle", scope: !47, file: !1, line: 38, type: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "hypre_ParCSRCommHandle", file: !22, line: 101, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 92, size: 320, elements: !123)
!123 = !{!124, !125, !126, !127, !128}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "comm_pkg", scope: !122, file: !22, line: 94, baseType: !20, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "send_data", scope: !122, file: !22, line: 95, baseType: !7, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "recv_data", scope: !122, file: !22, line: 96, baseType: !7, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "num_requests", scope: !122, file: !22, line: 98, baseType: !10, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !122, file: !22, line: 99, baseType: !129, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !4, line: 430, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !4, line: 430, flags: DIFlagFwdDecl)
!133 = !DILocalVariable(name: "tmp_comm_pkg", scope: !47, file: !1, line: 39, type: !20)
!134 = !DILocalVariable(name: "A_diag", scope: !47, file: !1, line: 41, type: !62)
!135 = !DILocalVariable(name: "A_diag_data", scope: !47, file: !1, line: 42, type: !39)
!136 = !DILocalVariable(name: "A_diag_i", scope: !47, file: !1, line: 43, type: !9)
!137 = !DILocalVariable(name: "A_diag_j", scope: !47, file: !1, line: 44, type: !9)
!138 = !DILocalVariable(name: "A_offd", scope: !47, file: !1, line: 46, type: !62)
!139 = !DILocalVariable(name: "A_offd_data", scope: !47, file: !1, line: 47, type: !39)
!140 = !DILocalVariable(name: "A_offd_i", scope: !47, file: !1, line: 48, type: !9)
!141 = !DILocalVariable(name: "A_offd_j", scope: !47, file: !1, line: 49, type: !9)
!142 = !DILocalVariable(name: "col_map_offd_A", scope: !47, file: !1, line: 50, type: !11)
!143 = !DILocalVariable(name: "num_cols_offd_A", scope: !47, file: !1, line: 51, type: !10)
!144 = !DILocalVariable(name: "S_diag", scope: !47, file: !1, line: 53, type: !62)
!145 = !DILocalVariable(name: "S_diag_i", scope: !47, file: !1, line: 54, type: !9)
!146 = !DILocalVariable(name: "S_diag_j", scope: !47, file: !1, line: 55, type: !9)
!147 = !DILocalVariable(name: "S_offd", scope: !47, file: !1, line: 57, type: !62)
!148 = !DILocalVariable(name: "S_offd_i", scope: !47, file: !1, line: 58, type: !9)
!149 = !DILocalVariable(name: "S_offd_j", scope: !47, file: !1, line: 59, type: !9)
!150 = !DILocalVariable(name: "col_map_offd_S", scope: !47, file: !1, line: 60, type: !11)
!151 = !DILocalVariable(name: "num_cols_offd_S", scope: !47, file: !1, line: 61, type: !10)
!152 = !DILocalVariable(name: "col_map_offd", scope: !47, file: !1, line: 62, type: !11)
!153 = !DILocalVariable(name: "num_cols_offd", scope: !47, file: !1, line: 63, type: !10)
!154 = !DILocalVariable(name: "P", scope: !47, file: !1, line: 65, type: !50)
!155 = !DILocalVariable(name: "P_diag", scope: !47, file: !1, line: 66, type: !62)
!156 = !DILocalVariable(name: "P_diag_data", scope: !47, file: !1, line: 67, type: !39)
!157 = !DILocalVariable(name: "P_diag_i", scope: !47, file: !1, line: 68, type: !9)
!158 = !DILocalVariable(name: "P_diag_j", scope: !47, file: !1, line: 70, type: !9)
!159 = !DILocalVariable(name: "P_offd", scope: !47, file: !1, line: 72, type: !62)
!160 = !DILocalVariable(name: "P_offd_data", scope: !47, file: !1, line: 73, type: !39)
!161 = !DILocalVariable(name: "P_offd_i", scope: !47, file: !1, line: 74, type: !9)
!162 = !DILocalVariable(name: "P_offd_j", scope: !47, file: !1, line: 76, type: !9)
!163 = !DILocalVariable(name: "num_sends", scope: !47, file: !1, line: 78, type: !10)
!164 = !DILocalVariable(name: "int_buf_data", scope: !47, file: !1, line: 79, type: !9)
!165 = !DILocalVariable(name: "big_buf_data", scope: !47, file: !1, line: 80, type: !11)
!166 = !DILocalVariable(name: "send_map_start", scope: !47, file: !1, line: 81, type: !9)
!167 = !DILocalVariable(name: "send_map_elmt", scope: !47, file: !1, line: 82, type: !9)
!168 = !DILocalVariable(name: "send_procs", scope: !47, file: !1, line: 83, type: !9)
!169 = !DILocalVariable(name: "num_recvs", scope: !47, file: !1, line: 84, type: !10)
!170 = !DILocalVariable(name: "recv_vec_start", scope: !47, file: !1, line: 85, type: !9)
!171 = !DILocalVariable(name: "recv_procs", scope: !47, file: !1, line: 86, type: !9)
!172 = !DILocalVariable(name: "new_recv_vec_start", scope: !47, file: !1, line: 87, type: !9)
